{
  "metadata": {
    "pillar_id": "3",
    "status": "branches_complete",
    "created": "2026-01-04",
    "last_updated": "2026-01-04",
    "notes": "Sub-Pillars and Branches defined. Ready for Topic Domain generation."
  },
  "pillar": {
    "id": "3",
    "title": "Systems, Infrastructure, Technology and Operations",
    "definition": "The non-human systems that make anesthesia possible: facilities, OR operations, workflows, IT, cybersecurity, anesthesia machines, monitors, supply chain, turnover processes, and documentation systems. This pillar maps both the physical and digital infrastructure that enables safe anesthesia delivery and the operational systems that drive efficiency and quality.",
    "inclusion_tests": [
      "Is this about how the environment, technology, or system functions so anesthesia care can occur?",
      "Is this about physical infrastructure (OR layout, gas pipelines, HVAC, electrical)?",
      "Is this about equipment (anesthesia machines, monitors, infusion pumps, lifecycle management)?",
      "Is this about IT systems (AIMS, EHR integration, device connectivity, networks)?",
      "Is this about cybersecurity (device security, network segmentation, data protection)?",
      "Is this about supply chain (ADCs, inventory, controlled substances, pharmacy systems)?",
      "Is this about operational workflow (turnover time, scheduling, efficiency, quality systems)?"
    ],
    "exclusion_tests": [
      "Clinical decision-making, patient physiology, drug administration protocols → Pillar 1",
      "CRNA/MDA roles, scope of practice, training pathways, credentialing authority → Pillar 2",
      "State supervision laws, CMS regulations, malpractice liability, DEA compliance → Pillar 4",
      "Contracts, billing, RVUs, compensation structures, business entity formation → Pillar 5",
      "Education methods, research studies, evidence-based guidelines, AI innovation → Pillar 6",
      "Career paths, W2→1099 transitions, leadership development, job market dynamics → Pillar 7",
      "Burnout, OR politics, work-life balance, DEI, professional culture, identity → Pillar 8"
    ],
    "sub_pillars": [
      {
        "id": "3.1",
        "title": "Physical Infrastructure and Facility Systems",
        "definition": "The built environment and utility systems that enable anesthesia delivery: OR design and layout, medical gas pipelines, electrical systems, HVAC and infection control, lighting, and communication infrastructure. This sub-pillar also covers the distinct characteristics of different facility types—academic medical centers, community hospitals, ambulatory surgery centers, office-based settings, and mobile anesthesia—and how infrastructure scales across these environments.",
        "branches": [
          {
            "id": "3.1.1",
            "title": "OR Design, Layout and Physical Space",
            "definition": "The architectural and ergonomic design of operating rooms and anesthesia workspaces, including room dimensions, equipment positioning, sterile zones, workflow optimization, and adjacency to support areas.",
            "lens": "Understanding how physical space design affects safety, efficiency, and clinical workflow",
            "topic_domains": [
              {
                "id": "3.1.1-1",
                "title": "OR Room Dimensions and Space Standards",
                "definition": "Standard operating room sizes (400-600 ft²), ceiling height requirements, clearance zones, and minimum space allocations per FGI Guidelines. Includes how room dimensions affect equipment placement, team movement, and procedural safety."
              },
              {
                "id": "3.1.1-2",
                "title": "Functional Zones and Sterile Field Organization",
                "definition": "The organization of OR space into functional zones: sterile field, instrument preparation area, anesthesia workspace, circulator zone, and support spaces. Covers traffic patterns, contamination prevention, and zone boundary management."
              },
              {
                "id": "3.1.1-3",
                "title": "Anesthesia Workstation Positioning and Ergonomics",
                "definition": "Optimal placement of the anesthesia machine, equipment booms, monitors, supply carts, and documentation stations. Addresses ergonomic principles, line-of-sight to patient and monitors, and workflow efficiency for the anesthesia provider."
              },
              {
                "id": "3.1.1-4",
                "title": "Adjacency Planning and Support Space Design",
                "definition": "The relationship between ORs and adjacent spaces: pre-operative holding, PACU, sterile processing, supply rooms, and control desks. Covers traffic flow patterns, patient transport routes, and efficient material movement."
              },
              {
                "id": "3.1.1-5",
                "title": "Hybrid OR Design and Imaging Integration",
                "definition": "Special design considerations for hybrid operating rooms that combine surgery with advanced imaging (angiography, CT, MRI). Includes electromagnetic shielding, equipment clearances, and radiation protection infrastructure."
              },
              {
                "id": "3.1.1-6",
                "title": "Human Factors and Workflow-Optimized Design",
                "definition": "Application of human factors engineering to OR design: standardized room orientations, lean layout principles, parallel workflow models (pit crew approach), and design features that reduce errors and improve team performance."
              }
            ]
          },
          {
            "id": "3.1.2",
            "title": "Medical Gas, Vacuum and Utility Systems",
            "definition": "The pipeline infrastructure that delivers oxygen, nitrous oxide, medical air, suction vacuum, and waste anesthetic gas disposal (WAGD) to the anesthesia workstation, including bulk sources, zone valves, outlet connections, and alarm systems.",
            "lens": "Understanding the utility backbone that makes gas delivery and scavenging possible",
            "topic_domains": [
              {
                "id": "3.1.2-1",
                "title": "Medical Gas Sources and Distribution Architecture",
                "definition": "Bulk storage systems (liquid oxygen, cylinder banks), manifold configurations, main supply lines, riser diagrams, and zone valve placement. Covers how medical gases travel from source to point of use throughout the facility."
              },
              {
                "id": "3.1.2-2",
                "title": "Pipeline Pressure Regulation and Delivery Standards",
                "definition": "Pressure specifications for medical gases (50 psi for O₂/air/N₂O, 25 psi for vacuum), regulator staging, pressure relief systems, and NFPA 99 compliance requirements for safe gas delivery."
              },
              {
                "id": "3.1.2-3",
                "title": "Outlet Systems and Connection Standards",
                "definition": "Wall and ceiling outlet configurations, Diameter Index Safety System (DISS) connectors, color coding standards, quick-connect fittings, and the pin-index safety system for cylinders. Covers how outlets prevent misconnection."
              },
              {
                "id": "3.1.2-4",
                "title": "Vacuum and Suction Infrastructure",
                "definition": "Central vacuum system design, pump configurations, receiver tanks, surgical vs clinical suction levels, and distribution to OR outlets. Includes capacity planning and redundancy requirements."
              },
              {
                "id": "3.1.2-5",
                "title": "Waste Anesthetic Gas Disposal (WAGD) Systems",
                "definition": "Scavenging system infrastructure that removes waste anesthetic gases from the OR environment. Covers passive vs active scavenging, dedicated WAGD vacuum, interface connections, and OSHA/NIOSH exposure limits."
              },
              {
                "id": "3.1.2-6",
                "title": "Medical Gas Alarm and Monitoring Systems",
                "definition": "Central alarm panels, area alarm systems, zone monitoring, pressure sensors, and alert protocols for medical gas system failures. Covers alarm prioritization, staff notification, and emergency response procedures."
              }
            ]
          },
          {
            "id": "3.1.3",
            "title": "Electrical Power, Environmental Control and Safety Systems",
            "definition": "The electrical infrastructure (isolated power systems, line-isolation monitors, emergency generators, UPS) and environmental systems (HVAC, ventilation, positive pressure, temperature/humidity control, lighting) that maintain a safe and controlled OR environment.",
            "lens": "Understanding the environmental and power systems that protect patients and enable uninterrupted care",
            "topic_domains": [
              {
                "id": "3.1.3-1",
                "title": "Isolated Power Systems and Electrical Safety",
                "definition": "Isolated power system (IPS) design for wet procedure locations, line-isolation monitors (LIM), ground fault protection, and electrical safety in the OR environment. Covers NEC and NFPA 99 requirements for anesthetizing locations."
              },
              {
                "id": "3.1.3-2",
                "title": "Emergency Power and Backup Systems",
                "definition": "On-site generator systems, automatic transfer switches, uninterruptible power supplies (UPS), and emergency power outlet identification (red receptacles). Covers NFPA 110 requirements and critical load prioritization."
              },
              {
                "id": "3.1.3-3",
                "title": "HVAC System Design and Air Filtration",
                "definition": "Air handling unit configurations, high-efficiency filtration (HEPA, MERV 14+), air changes per hour (15-20+ ACH), and ductwork design for OR ventilation. Covers ASHRAE 170 standards and infection control requirements."
              },
              {
                "id": "3.1.3-4",
                "title": "Positive Pressure and Laminar Airflow Patterns",
                "definition": "Maintaining positive pressure differentials between OR and adjacent spaces, laminar (unidirectional) flow from ceiling diffusers, low-wall exhaust placement, and airflow visualization. Covers contamination prevention principles."
              },
              {
                "id": "3.1.3-5",
                "title": "Temperature, Humidity and Climate Control",
                "definition": "OR temperature setpoints (68-75°F), humidity ranges (30-60%), independent zone controls, and the impact of climate on patient safety, infection rates, and fire risk. Covers monitoring and adjustment capabilities."
              },
              {
                "id": "3.1.3-6",
                "title": "Surgical and Ambient Lighting Systems",
                "definition": "LED surgical light technology, boom and ceiling track mounting, shadow reduction, color rendering, sterile handle controls, and ambient room lighting. Covers redundancy requirements and battery backup for critical lighting."
              },
              {
                "id": "3.1.3-7",
                "title": "Communication and Integration Infrastructure",
                "definition": "Intercom and nurse call systems, video conferencing links, emergency code buttons, paging integration, and data network connections in the OR. Covers how communication systems support team coordination and emergency response."
              }
            ]
          },
          {
            "id": "3.1.4",
            "title": "Facility Types and Setting-Specific Infrastructure",
            "definition": "The distinct infrastructure characteristics of different anesthesia care settings: academic medical centers, community hospitals, ambulatory surgery centers, office-based anesthesia, mobile anesthesia, procedural suites, and rural versus urban facilities.",
            "lens": "Understanding how infrastructure scales and adapts across different practice environments",
            "topic_domains": [
              {
                "id": "3.1.4-1",
                "title": "Academic Medical Center Infrastructure",
                "definition": "Complex OR suite configurations in teaching hospitals: subspecialty rooms, hybrid imaging ORs, trauma bays, transplant facilities, ICU adjacency, multiple levels of backup systems, and infrastructure supporting education and research."
              },
              {
                "id": "3.1.4-2",
                "title": "Community Hospital OR Infrastructure",
                "definition": "Standard OR suite design for community hospitals: typical 2-6 room configurations, general-purpose room design, standard equipment complement, and appropriate backup system capacity for mid-acuity surgical services."
              },
              {
                "id": "3.1.4-3",
                "title": "Ambulatory Surgery Center Design and Requirements",
                "definition": "ASC-specific infrastructure: streamlined suite design (4-8 rooms), efficient patient flow layouts, fast turnover optimization, CMS and accreditation requirements (AAAHC, AAAASF), and scaled utility systems."
              },
              {
                "id": "3.1.4-4",
                "title": "Office-Based Anesthesia Facility Requirements",
                "definition": "Infrastructure requirements for anesthesia in physician or dental offices: procedure room retrofitting, portable oxygen systems, basic monitoring capabilities, state regulatory requirements, and minimum safety standards."
              },
              {
                "id": "3.1.4-5",
                "title": "Mobile and Dental Anesthesia Infrastructure",
                "definition": "Equipment and infrastructure for mobile anesthesia services: portable anesthesia machines, cylinder gas systems (E and J-size), battery-powered monitors, vehicle-based setups, and communication systems for remote locations."
              },
              {
                "id": "3.1.4-6",
                "title": "Procedural Suite Infrastructure",
                "definition": "Infrastructure characteristics of non-OR procedural areas: cardiac catheterization labs, endoscopy suites, interventional radiology, and freestanding emergency departments. Covers anesthesia-specific requirements in these settings."
              },
              {
                "id": "3.1.4-7",
                "title": "Rural and Critical Access Hospital Considerations",
                "definition": "Unique infrastructure challenges in rural settings: multi-purpose room design, limited redundancy, Critical Access Hospital (CAH) designations, off-grid contingencies, and tele-anesthesia support infrastructure."
              }
            ]
          }
        ]
      },
      {
        "id": "3.2",
        "title": "Anesthesia Equipment and Medical Device Ecosystem",
        "definition": "The devices and equipment used to deliver and monitor anesthesia care: anesthesia machines and workstations, physiologic monitors, infusion pumps, airway devices, point-of-care analyzers, and specialty equipment. This sub-pillar encompasses the complete equipment lifecycle from capital planning and procurement through installation, preventive maintenance, calibration, repairs, and end-of-life replacement.",
        "branches": [
          {
            "id": "3.2.1",
            "title": "Anesthesia Machine Architecture and Function",
            "definition": "The core components and operating principles of anesthesia machines and workstations: high-pressure, intermediate-pressure, and low-pressure circuits; flowmeters and vaporizers; breathing circuits and ventilators; scavenging systems; and integrated safety features.",
            "lens": "Understanding how the anesthesia machine delivers gases and ventilation safely",
            "topic_domains": []
          },
          {
            "id": "3.2.2",
            "title": "Physiologic Monitoring Systems",
            "definition": "The monitors and sensors that track patient status during anesthesia: multi-parameter monitors (ECG, SpO₂, NIBP, EtCO₂, temperature), invasive pressure monitoring, neuromuscular and depth-of-anesthesia monitors, alarm systems, and data integration with clinical records.",
            "lens": "Understanding the monitoring ecosystem that provides real-time patient data",
            "topic_domains": []
          },
          {
            "id": "3.2.3",
            "title": "Infusion Systems and Point-of-Care Devices",
            "definition": "Smart infusion pumps with drug libraries, syringe drivers, patient-controlled analgesia systems, and point-of-care testing devices (blood gas analyzers, glucose meters, coagulation testers) used in anesthesia care.",
            "lens": "Understanding drug delivery technology and rapid diagnostic devices at the bedside",
            "topic_domains": []
          },
          {
            "id": "3.2.4",
            "title": "Airway, Specialty and Emergency Equipment",
            "definition": "Airway management devices (video laryngoscopes, fiberoptic bronchoscopes, supraglottic airways), ultrasound for regional anesthesia, difficult airway carts, malignant hyperthermia carts, defibrillators, and other specialty or emergency equipment.",
            "lens": "Understanding specialized tools for airway management, regional techniques, and emergency response",
            "topic_domains": []
          },
          {
            "id": "3.2.5",
            "title": "Equipment Lifecycle Management",
            "definition": "The complete lifecycle of anesthesia equipment: capital planning and procurement, vendor selection and GPO contracts, installation and acceptance testing, preventive maintenance and calibration, repairs and service contracts, asset tracking, and end-of-life replacement.",
            "lens": "Understanding how equipment is acquired, maintained, and retired over time",
            "topic_domains": []
          }
        ]
      },
      {
        "id": "3.3",
        "title": "Information Technology, Clinical Informatics and Cybersecurity",
        "definition": "The digital systems that capture, process, protect, and transmit anesthesia data: Anesthesia Information Management Systems (AIMS), EHR integration, device connectivity and interoperability, network architecture, clinical decision support, and OR scheduling software. This sub-pillar also addresses the growing domain of cybersecurity—device vulnerabilities, network segmentation, patch management, threat detection, and regulatory compliance for data protection.",
        "branches": [
          {
            "id": "3.3.1",
            "title": "Anesthesia Information Management and EHR Integration",
            "definition": "Anesthesia Information Management Systems (AIMS) that capture vital signs, document medication administration, and generate the anesthesia record, including integration with hospital EHR platforms, clinical decision support, and barcode medication administration.",
            "lens": "Understanding the clinical documentation and decision support systems for anesthesia",
            "topic_domains": []
          },
          {
            "id": "3.3.2",
            "title": "Device Connectivity and Interoperability",
            "definition": "How anesthesia devices (monitors, machines, pumps) connect and communicate with clinical information systems, including interface engines, device gateways, data standards (HL7, IEEE 11073, FHIR), and middleware solutions.",
            "lens": "Understanding how devices share data with each other and with clinical systems",
            "topic_domains": []
          },
          {
            "id": "3.3.3",
            "title": "Network Infrastructure and System Architecture",
            "definition": "The IT infrastructure supporting anesthesia operations: wired and wireless networks, VLANs, servers and cloud platforms, redundancy and failover systems, OR scheduling software, and real-time location systems (RTLS).",
            "lens": "Understanding the network and computing foundation that enables clinical IT systems",
            "topic_domains": []
          },
          {
            "id": "3.3.4",
            "title": "Cybersecurity, Data Protection and Compliance",
            "definition": "Security of medical devices and networks: vulnerability management, network segmentation, patch management, threat detection and response, access control and authentication, data encryption, HIPAA compliance, and FDA cybersecurity requirements including SBOM.",
            "lens": "Understanding how anesthesia systems are protected from cyber threats and data breaches",
            "topic_domains": []
          }
        ]
      },
      {
        "id": "3.4",
        "title": "Supply Chain, Workflow and Operational Quality Systems",
        "definition": "The operational systems that ensure resource availability, workflow efficiency, and quality assurance: automated dispensing cabinets, controlled substance management, inventory and pharmacy systems, OR scheduling and turnover optimization, Lean/Six Sigma process engineering, incident reporting, quality dashboards, disaster preparedness, and safety infrastructure including fire and radiation protection. This sub-pillar maps how operations are engineered for efficiency and how quality and safety systems provide resilience and continuous improvement.",
        "branches": [
          {
            "id": "3.4.1",
            "title": "Medication Supply and Automated Dispensing",
            "definition": "Automated dispensing cabinets (ADCs), controlled substance management and diversion monitoring, anesthesia medication carts and trays, and integration with pharmacy systems for secure, efficient drug access.",
            "lens": "Understanding how medications are stored, dispensed, tracked, and secured",
            "topic_domains": []
          },
          {
            "id": "3.4.2",
            "title": "Inventory, Supply Chain and Resource Management",
            "definition": "Supply ordering and inventory systems, par level management, just-in-time delivery, vendor and GPO relationships, recall and expiry tracking, and resource allocation for anesthesia supplies and disposables.",
            "lens": "Understanding how supplies flow from vendor to point of care",
            "topic_domains": []
          },
          {
            "id": "3.4.3",
            "title": "OR Scheduling and Case Flow Optimization",
            "definition": "OR scheduling systems, block management, case booking and add-on workflows, first-case on-time starts, patient throughput from pre-op through PACU, and digital dashboards for real-time case status.",
            "lens": "Understanding how cases are scheduled and patients flow through the perioperative environment",
            "topic_domains": []
          },
          {
            "id": "3.4.4",
            "title": "Process Engineering and Workflow Efficiency",
            "definition": "Lean and Six Sigma methodologies applied to anesthesia operations, turnover time optimization, parallel processing, value stream mapping, communication workflows (huddles, SBAR), and continuous improvement initiatives.",
            "lens": "Understanding how operations are engineered for efficiency and waste reduction",
            "topic_domains": []
          },
          {
            "id": "3.4.5",
            "title": "Quality, Safety and Continuity Systems",
            "definition": "Incident reporting and root cause analysis, quality dashboards and performance metrics, ERAS pathway infrastructure, disaster preparedness and downtime procedures, fire and radiation safety protocols, and emergency equipment readiness.",
            "lens": "Understanding the systems that monitor quality, ensure safety, and maintain operational resilience",
            "topic_domains": []
          }
        ]
      }
    ]
  },
  "statistics": {
    "sub_pillars": 4,
    "branches": 18,
    "topic_domains": 0
  }
}
