{
  "metadata": {
    "pillar_id": "3",
    "status": "sub_pillars_complete",
    "created": "2026-01-04",
    "last_updated": "2026-01-04",
    "notes": "Sub-Pillars defined. Ready for Branch generation."
  },
  "pillar": {
    "id": "3",
    "title": "Systems, Infrastructure, Technology and Operations",
    "definition": "The non-human systems that make anesthesia possible: facilities, OR operations, workflows, IT, cybersecurity, anesthesia machines, monitors, supply chain, turnover processes, and documentation systems. This pillar maps both the physical and digital infrastructure that enables safe anesthesia delivery and the operational systems that drive efficiency and quality.",
    "inclusion_tests": [
      "Is this about how the environment, technology, or system functions so anesthesia care can occur?",
      "Is this about physical infrastructure (OR layout, gas pipelines, HVAC, electrical)?",
      "Is this about equipment (anesthesia machines, monitors, infusion pumps, lifecycle management)?",
      "Is this about IT systems (AIMS, EHR integration, device connectivity, networks)?",
      "Is this about cybersecurity (device security, network segmentation, data protection)?",
      "Is this about supply chain (ADCs, inventory, controlled substances, pharmacy systems)?",
      "Is this about operational workflow (turnover time, scheduling, efficiency, quality systems)?"
    ],
    "exclusion_tests": [
      "Clinical decision-making, patient physiology, drug administration protocols → Pillar 1",
      "CRNA/MDA roles, scope of practice, training pathways, credentialing authority → Pillar 2",
      "State supervision laws, CMS regulations, malpractice liability, DEA compliance → Pillar 4",
      "Contracts, billing, RVUs, compensation structures, business entity formation → Pillar 5",
      "Education methods, research studies, evidence-based guidelines, AI innovation → Pillar 6",
      "Career paths, W2→1099 transitions, leadership development, job market dynamics → Pillar 7",
      "Burnout, OR politics, work-life balance, DEI, professional culture, identity → Pillar 8"
    ],
    "sub_pillars": [
      {
        "id": "3.1",
        "title": "Physical Infrastructure and Facility Systems",
        "definition": "The built environment and utility systems that enable anesthesia delivery: OR design and layout, medical gas pipelines, electrical systems, HVAC and infection control, lighting, and communication infrastructure. This sub-pillar also covers the distinct characteristics of different facility types—academic medical centers, community hospitals, ambulatory surgery centers, office-based settings, and mobile anesthesia—and how infrastructure scales across these environments.",
        "branches": []
      },
      {
        "id": "3.2",
        "title": "Anesthesia Equipment and Medical Device Ecosystem",
        "definition": "The devices and equipment used to deliver and monitor anesthesia care: anesthesia machines and workstations, physiologic monitors, infusion pumps, airway devices, point-of-care analyzers, and specialty equipment. This sub-pillar encompasses the complete equipment lifecycle from capital planning and procurement through installation, preventive maintenance, calibration, repairs, and end-of-life replacement.",
        "branches": []
      },
      {
        "id": "3.3",
        "title": "Information Technology, Clinical Informatics and Cybersecurity",
        "definition": "The digital systems that capture, process, protect, and transmit anesthesia data: Anesthesia Information Management Systems (AIMS), EHR integration, device connectivity and interoperability, network architecture, clinical decision support, and OR scheduling software. This sub-pillar also addresses the growing domain of cybersecurity—device vulnerabilities, network segmentation, patch management, threat detection, and regulatory compliance for data protection.",
        "branches": []
      },
      {
        "id": "3.4",
        "title": "Supply Chain, Workflow and Operational Quality Systems",
        "definition": "The operational systems that ensure resource availability, workflow efficiency, and quality assurance: automated dispensing cabinets, controlled substance management, inventory and pharmacy systems, OR scheduling and turnover optimization, Lean/Six Sigma process engineering, incident reporting, quality dashboards, disaster preparedness, and safety infrastructure including fire and radiation protection. This sub-pillar maps how operations are engineered for efficiency and how quality and safety systems provide resilience and continuous improvement.",
        "branches": []
      }
    ]
  },
  "statistics": {
    "sub_pillars": 4,
    "branches": 0,
    "topic_domains": 0
  }
}
