{
  "metadata": {
    "pillar_id": "5",
    "status": "sub_pillars_complete",
    "created": "2026-01-04",
    "last_updated": "2026-01-05"
  },
  "pillar": {
    "id": "5",
    "title": "Economics, Finance, Contracting and Business Structures",
    "definition": "All money flows and business mechanics of anesthesia – covering billing, reimbursement, RVUs, revenue cycle, subsidies, stipends, negotiation, 1099 economics, entity structures, agency dynamics, MSOs, private equity groups, and financial strategy for providers and organizations.",
    "inclusion_tests": [
      "Is this about how money moves or how business entities are structured in anesthesia?",
      "Is this about payment models, contract terms, or compensation formulas?",
      "Is this about billing, coding, or reimbursement mechanics?",
      "Is this about entity structures (PC, PLLC, S-Corp)?",
      "Is this about agency economics, MSO fees, or PE investment models?",
      "Is this about tax strategies, financial planning, or wealth building?",
      "Is this about the financial mechanics of contract negotiation?"
    ],
    "exclusion_tests": [
      "Clinical practice, physiology, patient care → Pillar 1",
      "Role definitions, scope, training, credentialing, CRNA-MDA dynamics → Pillar 2",
      "OR operations, equipment, IT systems, infrastructure → Pillar 3",
      "Legal statutes, Stark Law text, Anti-Kickback statute, malpractice law, compliance rules → Pillar 4",
      "Education methods, research, evidence-based practice → Pillar 6",
      "Career decisions, leadership development, job market dynamics, W2→1099 transition decisions → Pillar 7",
      "Burnout, wellbeing, culture, OR politics, DEI → Pillar 8"
    ],
    "sub_pillars": [
      {
        "id": "5.1",
        "title": "Billing, Reimbursement, and Revenue Cycle",
        "definition": "The technical mechanics of how anesthesia services generate revenue – from billing unit calculations and CPT coding to payer dynamics, revenue cycle management, and regulatory frameworks like the No Surprises Act. This sub-pillar covers the foundational 'money in' systems that convert clinical work into collectible revenue.",
        "branches": []
      },
      {
        "id": "5.2",
        "title": "Compensation Models and Contract Economics",
        "definition": "How individual anesthesia providers are paid and the contractual arrangements governing employment, independent contractor, and locum tenens work. This sub-pillar covers W2 salary structures, 1099 rate mechanics, per diem and call compensation, employment contract anatomy, and the strategies and tactics of rate negotiation.",
        "branches": []
      },
      {
        "id": "5.3",
        "title": "Business Entities, Practice Models, and Organizational Economics",
        "definition": "How anesthesia practices are structured as business entities and the economic dynamics of different practice models. This sub-pillar covers entity formation (PC, PLLC, S-Corp), hospital-employed economics, private group structures, private equity and MSO arrangements, CRNA-owned practices, ACT model economics, and facility subsidies and stipends.",
        "branches": []
      },
      {
        "id": "5.4",
        "title": "Financial Planning, Tax Strategy, and Market Intelligence",
        "definition": "Strategic financial optimization for anesthesia professionals and organizations, including tax planning, wealth building, and market analysis. This sub-pillar covers W2 vs 1099 tax comparison, entity-level tax strategies, multi-state taxation, retirement planning, agency economics, compensation benchmarking, supply-demand dynamics, and financial decision frameworks.",
        "branches": []
      }
    ]
  },
  "statistics": {
    "sub_pillars": 4,
    "branches": 0,
    "topic_domains": 0
  }
}
